---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceAnisotropy
source: html/93afd0e7-2143-dea7-3ee6-e7734f5bf538.htm
---
# Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceAnisotropy Property

The property labeled "Anisotropy" from the "AdvancedOpaque" schema.

## Syntax (C#)
```csharp
public static string SurfaceAnisotropy { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.